Былков_ДА_70180166/src/Documents/ПриказОбОтчислении/ПриказОбОтчислении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОбОтчислении</name>
  <basedOn>Document.ПротоколЗаседанияКомиссии</basedOn>
  <registerRecords>AccumulationRegister.ПросроченныеЗадолженностиДляОтчисления</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПротоколЗаседанияКомиссии</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/AccumulationRegisters/ПросроченныеЗадолженностиДляОтчисления/ПросроченныеЗадолженностиДляОтчисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПросроченныеЗадолженностиДляОтчисления</name>
  <resources>
    <name>КоличествоПросроченныхЗадолженностейДляОтчисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Былков_ДА_70180166/src/Documents/ПротоколЗаседанияКомиссии/ПротоколЗаседанияКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколЗаседанияКомиссии</name>
  <basedOn>Document.РекомендацииПоСтудентам</basedOn>
  <registerRecords>AccumulationRegister.ДинамикаЛиквидацииЗадолженностей</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВозникшихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РекомендацииПоСтудентам</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.СтатусыАкадемическихЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УчетАкадемическихЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/ПриказОбОтчислении/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколЗаседанияКомиссии") Тогда 
			
		
        // Получаем данные из документа-основания
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    ПротоколЗаседанияКомиссии.КоличествоВозникшихЗадолженностей,
        |    ПротоколЗаседанияКомиссии.КоличествоЛиквидированныхЗадолженностей,
        |    ПротоколЗаседанияКомиссии.ПроцентЗадолженностей,
        |    ПротоколЗаседанияКомиссии.Группа,
        |    ПротоколЗаседанияКомиссии.Семестр,
        |    ПротоколЗаседанияКомиссии.Студент
        |ИЗ
        |    Документ.ПротоколЗаседанияКомиссии КАК ПротоколЗаседанияКомиссии
        |ГДЕ
        |    ПротоколЗаседанияКомиссии.Ссылка = &СсылкаНаДокумент";
        
        Запрос.УстановитьПараметр("СсылкаНаДокумент", ДанныеЗаполнения);
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        
        Если Не Выборка.Следующий() Тогда
            СтандартнаяОбработка = Ложь;
            ВызватьИсключение "Не удалось получить данные из документа-основания (Протокол заседания комиссии).";
        КонецЕсли;
        
        // Заполняем реквизиты документа
        ЭтотОбъект.Группа = Выборка.Группа;
        ЭтотОбъект.Семестр = Выборка.Семестр;
        ЭтотОбъект.Основание = ДанныеЗаполнения;
        ЭтотОбъект.Студент = Выборка.Студент;
        ЭтотОбъект.КоличествоЛиквидированныхЗадолженностей = Выборка.КоличествоЛиквидированныхЗадолженностей;
        
        // Получаем данные студента
        ДанныеСтудента = ПолучитьДанныеСтудента(ЭтотОбъект.Студент);
        
        Если ДанныеСтудента.Свойство("НаправлениеПодготовки") Тогда
            ЭтотОбъект.НаправлениеПодготовки = ДанныеСтудента.НаправлениеПодготовки;
        КонецЕсли;
        
        // Проверяем основания для отчисления в правильном порядке:
        
        // 1. Сначала проверяем неудачную вторую попытку (активные задолженности)
        Если ПроверитьАктивныеЗадолженности(Выборка.Студент).ЕстьАктивныеЗадолженности Тогда
            Сообщить("Отчисление студента по результатам неудачной второй попытки ликвидации задолженности!", 
                    СтатусСообщения.Важное);
                
        // 2. Иначе, при отсутствии академических задолженностей, выдаем исключение
        Иначе
            СтандартнаяОбработка = Ложь;
            ВызватьИсключение "Студент имеет " + Выборка.ПроцентЗадолженностей + 
                            "% академических задолженностей! Ввод документа «Приказ об отчислении» " +
                            "возможен только при наличии активных задолженностей!";
		КонецЕсли;   
		
		ПроверитьНаличиеПриказа(Студент);

    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьАктивныеЗадолженности(Студент)
    
    Результат = Новый Структура;
    Результат.Вставить("ЕстьАктивныеЗадолженности", Ложь);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Ссылка
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ
    |ГДЕ
    |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Студент = &Студент
    |    И ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.СтатусАкадемическойЗадолженности = &АктивнаяЗадолженность
    |    И НЕ ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.ПометкаУдаления
    |    И ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Проведен";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("АктивнаяЗадолженность", Перечисления.НаименованиеСтатуса.Активная);
    
    Если Запрос.Выполнить().Выбрать().Следующий() Тогда
        Результат.ЕстьАктивныеЗадолженности = Истина;
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

&НаСервере
Процедура ПроверитьНаличиеПриказа(Студент)
    
    Если ПустаяСтрока(Студент) Тогда
        ДанныеСтудента = ПолучитьДанныеСтудента(Студент);
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ПриказОбОтчислении.Ссылка КАК Ссылка,
    |    ПриказОбОтчислении.Дата КАК Дата,
    |    ПриказОбОтчислении.Номер КАК Номер
    |ИЗ
    |    Документ.ПриказОбОтчислении КАК ПриказОбОтчислении
    |ГДЕ
    |    ПриказОбОтчислении.Студент = &Студент
    |    И ПриказОбОтчислении.ПометкаУдаления = ЛОЖЬ";

    Запрос.УстановитьПараметр("Студент", Студент);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Если Выборка.Количество() > 0 Тогда
        ВызватьИсключение("Для студента " + Студент + " уже существует «Приказ об отчислении»!");
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтудента(СсылкаНаСтудента) Экспорт
    Результат = Новый Структура;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.НаправлениеПодготовки КАК НаправлениеПодготовки,
    |	Студенты.Семестр КАК Семестр
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Результат.Вставить("НаправлениеПодготовки", Выборка.НаправлениеПодготовки);
		Результат.Вставить("Семестр", Выборка.Семестр);

	КонецЕсли;
    
    Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПросроченныеЗадолженностиДляОтчисления
	Движения.ПросроченныеЗадолженностиДляОтчисления.Записывать = Истина;
	Движение = Движения.ПросроченныеЗадолженностиДляОтчисления.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Семестр = Семестр;
	Движение.КоличествоПросроченныхЗадолженностейДляОтчисления = КоличествоЛиквидированныхЗадолженностей;

	КонецПроцедуры
